{
  "education": [
    {
      "awards_achievements": [
        "Dean's Honour List (2021-2022)"
      ],
      "degree": "Honours Bachelor of Computing, Computer Science",
      "department": "Queen's School of Computing",
      "duration": "2018-2022",
      "school_name": "Queen's University"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-En4zo",
  "highlighted_projects": [
    {
      "description": "Realized inter-thread communication mechanism using Java Sockets and RMI to allow different processes/thread to communicate over TCP/IP network. Compared different page replacement algorithms in a centralized system that uses virtual memory. Used a distributed system and implemented each page replacement algorithm on particular computer server.",
      "git_url": null,
      "name": "Distributed System and Inter-Thread Communication Mechanism(Java)"
    },
    {
      "description": "Analyzed and studied architecture, data flow of GNU Jami, and interaction subsystems of GUN Jami. Provided GNU Jami with features, replacing the central server with blockchain to store user accounts.",
      "git_url": null,
      "name": "GNU Jami Architectures Analysis"
    },
    {
      "description": "Implemented object detection model with YOLOv3 and VOC2007+2012 dataset. Realized real-time detection of 20 types of objects in video (including people, cars, boats, cats, dogs, etc.) Evaluated using mAP value, obtaining mAP of 84.22%.",
      "git_url": null,
      "name": "YOLOv3 Object Detection(Python)"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux monitoring agent that enables users to easily monitor and store machine specifications and usage information for multiple Linux systems. The agent utilizes Bash scripts to gather hardware information from the machines, which is then securely stored in a PostgreSQL database that is provisioned using Docker. To ensure accurate and up-to-date information, resource usage is fetched at regular intervals using Crontab. The collected data can then be easily analyzed and manipulated using SQL queries, providing users with valuable insights and performance metrics for their Linux systems.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "To deepen our understanding of relational databases, relational database management systems, structured query language, optimizations, and data models, we familiarized ourselves with these concepts through hands-on work. Using DBeaver as an IDE, we practiced manipulating existing data and compared our query results with expected outcomes. The existing data was stored in a file, clubdata.sql, which was imported into a PostgreSQL database deployed in a Docker container. This hands-on approach allowed us to gain a practical understanding of the concepts and strengthen our skills in the field.",
      "git_url": "/sql",
      "name": "Manipulate an Existing Database"
    }
  ],
  "name": "Enzuo Mou",
  "others": [
    {
      "bullets": [
        "Enjoy snowboarding on the slopes and gain experience in maintaining various snowboard gear. Aim to become a CASI Level 2 instructor.",
        "I enjoy road cycling and riding with a team at a pace of 27-30 km/h, covering distances of 50-110 km. I am also fond of riding sports gear.",
        "Worked as an IELTS teaching assistant in high school, assisting students with dictation and creating IELTS learning plans."
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Joined Jarvis as a junior software developer to develop, consult, and assist customers with their software solutions. I work in an Agile/Scrum development environment, where I participate in daily scrum meetings with the scrum master to discuss project progress. Our sprint cycle is two weeks, with a sprint meeting held every two weeks. At Jarvis, I have gained exposure to various technologies commonly used in professional technical environments, such as Java, RDMS, Linux, Docker, Spring Boot, etc.",
      "duration": "Jan 2022-present",
      "title": "Junior Software Developer"
    },
    {
      "company": "Poros Consulting",
      "description": "Assigned to implement a stock data analysis system. Adhering to the Agile methodology, I regularly updated my supervisor on my progress. I developed the web application using Django as the back-end framework and Apache ECharts for data visualization and stock trading history. My full-stack web development skills in HTML, CSS, and Javascript were utilized to design a RESTful back-end server for storing stock information persistently in MySQL. Throughout the project, I also created technical documents and prepared presentations to showcase my work to my supervisor. After completion, I presented the implemented components and demonstrated the functionality of the web application.",
      "duration": "July2022-Nov2022",
      "title": "Software Engineer"
    },
    {
      "company": "Start Computer Equipment Corporation",
      "description": "Tasked with comprehending the framework of the bank evaluation machine's management system and designing the user management page. The management system was implemented using Java and Spring Boot. I successfully completed the user management page, including adding the ability to query machines based on time, region, and relevant data stored in a MySQL database. Daily progress was reported to my instructor, and I also participated in weekly technology-sharing meetings with the team where the team leader would share interesting new projects and emerging technologies on Github with everyone.",
      "duration": "July2021-Sep2021",
      "title": "Software Engineer"
    }
  ],
  "skills": {
    "competent": [
      "Javascript",
      "Docker",
      "HTML/CSS",
      "Networking",
      "Springboot"
    ],
    "familiar": [
      "Machine Learning/Deep Learning",
      "Google Cloud Platform",
      "Echarts",
      "C",
      "Numpy",
      "Pandas",
      "Opencv",
      "Pytorch"
    ],
    "proficient": [
      "Java",
      "Python",
      "Linux/Bash/Shell",
      "Django",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git/Github"
    ]
  },
  "summary": "I am a recent graduate from Queen's University with a Bachelor's degree in Computer Science. I possess a solid foundation in fundamental concepts such as data structures, algorithms, and RDBM. My practical experience includes an internship at a computer equipment company where I developed a user management page and a search and delete function for a bank evaluation machine's evaluation system. Additionally, I have experience building a webapp for stock data analysis, demonstrating my ability to apply my technical skills to real-world projects. I possess strong coding,self-learning, and problem-solving skills, as demonstrated by my ability to quickly learn and apply new technologies. I believe that the operation of modern society is closely tied to computer technology, making it essential to have a deep understanding of it. I find great satisfaction in finding and resolving bugs while programming. My education and experiences have prepared me well for a career as a junior software engineer, and I am excited to begin my full-time career in this field."
}
