{
  "education": [
    {
      "awards_achievements": [
        "Dean's Honour List (2021-2022)",
        "GPA: 3.59/4.3"
      ],
      "degree": "Honours Bachelor of Computing, Computer Science",
      "department": "Queen's School of Computing",
      "duration": "2018-2022",
      "school_name": "Queen's University"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-En4zo/tree/main",
  "highlighted_projects": [
    {
      "description": "Realized inter-thread communication mechanism using Java Sockets and RMI to allow different processes/thread to communicate over TCP/IP (Transmission Control Protocol/Internet Protocol) network. Compared different page replacement algorithms in centralized system that uses virtual memory. Used distributed system and implemented each page replacement algorithm on particular computer server.",
      "git_url": null,
      "name": "Distributed system and Inter-Thread Communication Mechanism(Java)"
    },
    {
      "description": "Analyzed and studied architecture, data flow of GNU Jami, and interaction subsystems of GUN Jami.Provided GNU Jami with features, replacing central server with blockchain to store user accounts.",
      "git_url": null,
      "name": "GNU Jami Architectures Analysis"
    },
    {
      "description": "Implemented object detection model with YOLOv3 and VOC2007+2012 dataset. Realized real-time detection of 20 types of objects in video (including people, cars, boats, cats, dogs, etc.) Evaluated using mAP value, obtaining mAP of 84.22%.",
      "git_url": null,
      "name": "YOLOv3 Object Detection"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux monitoring agent that enables users to easily monitor and store machine specifications and usage information for multiple Linux systems. The agent utilizes Bash scripts to gather hardware information from the machines, which is then securely stored in a PostgreSQL database that is provisioned using Docker. To ensure accurate and up-to-date information, resource usage is fetched at regular intervals using Crontab. The collected data can then be easily analyzed and manipulated using SQL queries, providing users with valuable insights and performance metrics for their Linux systems.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "JDBC App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "Grep App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Enzuo Mou",
  "others": [
    {
      "bullets": [
        "Snowboard player",
        "Road Cycling",
        "IELTS teaching assistance at high school"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Implemented cluster monitor that allows user to monitor and store hardware specification and hardware usage information by bash script.Stored the hardware data and hardware usage data into PostgreSQL database provisioned using Docker. Fetched hardware usage periodically with Crontab.",
      "duration": "Jan 2022-present",
      "title": "Software Developer"
    },
    {
      "company": "Poros Consulting",
      "description": "Implemented by python(with Django as backend framework) to analyze stock data. Visualized companies information and stock exchange history with Apache ECharts. Leveraged knowledge in full stack web development with HTML, CSS and Javascript.Designed RESTful backend server enabling stock information to be stored persistently in an MySQL.",
      "duration": "July2022-Nov2022",
      "title": "Software Engineer"
    },
    {
      "company": "Start Computer Equipment Corporation",
      "description": "Designed user management pages for management system webapp of bank evaluation machine with using Java and Spring framework. Implemented functions that query machine based on time, area, or relevant data from MySQL database.",
      "duration": "July2021-Sep2021",
      "title": "Software Engineer"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "Python",
      "Django",
      "Networking",
      "Springboot",
      "Algorithm",
      "Data Structure"
    ],
    "familiar": [
      "HTML/CSS",
      "Javascript",
      "Machine Learning/Deep Learning",
      "Google Cloud Platform",
      "Echarts",
      "C",
      "Numpy",
      "Pandas",
      "Opencv",
      "Pytorch"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git/Github"
    ]
  },
  "summary": "I am a recent graduate from Queen's University with a Bachelor's degree in Computer Science. I have a strong understanding of fundamental computer science concepts such as data structures, algorithms, and SQL, and am proficient in various operating systems including Windows, macOS, and Linux. I have gained practical experience through an internship at a computer equipment company, where I added a user management page to a bank evaluation machine's evaluation system and implemented a search and delete function based on time and location. I possess strong coding, self-learning, and problem-solving skills, as demonstrated by my ability to quickly learn and apply new technologies, such as the Django framework. I believe that the operation of modern society is closely tied to computer technology, making it essential to have a deep understanding of it. I find great satisfaction in finding and resolving bugs while programming. My education and experiences have prepared me well for a career as a junior software engineer, and I am excited to begin my full-time career in this field."
}
